config/InformationRegisters/МониторПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МониторПродаж</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолвоШт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолвоЧеков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерКассы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/InformationRegisters/ПланПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПланПродаж</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/WebServices/MonitorSales/Ext/Module.bsl
Функция ПолучитьПродажи(СписокЧеков)Экспорт

	//ЧекиДляВыгрузки = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array"));
	
	Попытка
		
		Для Каждого элСтрока Из СписокЧеков.Value Цикл
			
			Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
			ОбъектХДТО = Сериализатор.ПрочитатьXDTO(элСтрока);

			//Продажи.Подразделение = Справочники.Подразделения.НайтиПоКоду(ОбъектХДТО.КодПодразделения,Истина);
			НайденнаяСсылка =  Справочники.Подразделения.НайтиПоРеквизиту("КодПодразделенияУТ",ОбъектХДТО.КодПодразделения);
			Если НЕ НайденнаяСсылка=Справочники.Подразделения.ПустаяСсылка() Тогда 
				Продажи	 = РегистрыСведений.МониторПродаж.СоздатьМенеджерЗаписи();
				Продажи.Период = ОбъектХДТО.Период; //дата-время чека
				Продажи.Подразделение = НайденнаяСсылка;
				Продажи.НомерКассы = ОбъектХДТО.НомерКассы;
				Продажи.Группа = ОбъектХДТО.Группа;
				
				
				Продажи.Сумма = ОбъектХДТО.Сумма ;
				Продажи.КолвоШт = ОбъектХДТО.КолвоШт;
				Продажи.КолвоЧеков = ОбъектХДТО.КолвоЧеков;
				
				Продажи.Время = ТекущаяДата();
				Продажи.Записать();
				
				//Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
				//ОбъектХДТО = Сериализатор .ЗаписатьXDTO(ОбъектХДТО.КодПодразделения);
				//
				//ЧекиДляВыгрузки.value.Добавить(ОбъектХДТО);
			КонеЦесли;
		КонецЦикла;
		Возврат  Истина;
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		Описание = Инфо.Описание;
	Возврат  Ложь;
	КонецПопытки;
	
		
КонецФункции

Функция ПолучитьПлан(СписокЧеков)Экспорт

	//ЧекиДляВыгрузки = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array"));
	
	Попытка
		
		Для Каждого элСтрока Из СписокЧеков.Value Цикл
			Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
			ОбъектХДТО = Сериализатор.ПрочитатьXDTO(элСтрока);
			
			
			НайденнаяСсылка =  Справочники.Подразделения.НайтиПоРеквизиту("КодПодразделенияУТ",ОбъектХДТО.КодПодразделения);
			Если НЕ НайденнаяСсылка=Справочники.Подразделения.ПустаяСсылка() Тогда
				ПланПродаж	 = РегистрыСведений.ПланПродаж.СоздатьМенеджерЗаписи();
				ПланПродаж.Период = ОбъектХДТО.Период;
				ПланПродаж.Подразделение = НайденнаяСсылка;
				ПланПродаж.Сумма = ОбъектХДТО.Сумма ;
				ПланПродаж.Записать();
				//Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
				//ОбъектХДТО = Сериализатор .ЗаписатьXDTO(ОбъектХДТО.КодПодразделения);
				//ЧекиДляВыгрузки.value.Добавить(ОбъектХДТО);
			КонецЕсли;
		КонецЦикла;
		Возврат  Истина;
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		Описание = Инфо.Описание;
		Возврат  Ложь;

	КонецПопытки;
		
КонецФункции
